app/views/movies/_form.html.erb

      <%= f.label :format %><br>
      <%= collection_check_boxes(:movie, :format_ids, Format.all, :id, :format) %>
---
SELECT "formats".id FROM "formats" WHERE "formats"."movie_id" = ?  [[nil, 1]]