app/views/movies/_showmovie.html.erb

<ul>
  <% @movie.formats.each do |format| %>
---
SELECT "formats".* FROM "formats" INNER JOIN "movie_formats" ON "formats"."id" = "movie_formats"."format_id" WHERE "movie_formats"."movie_id" = ?  [["movie_id", 1]]