app/views/movies/index.html.erb

SELECT "formats".* FROM "formats" INNER JOIN "movie_formats" ON "formats"."id" = "movie_formats"."format_id" WHERE "movie_formats"."movie_id" = ?  [["movie_id", 1]]
---
      <td>
          <% movie.formats.each do |format| %>