app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title LIKE '%%')
---
  def index
    @movies = Movie.search(params[:query])

INSERT INTO "movies" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Alien 3"], ["created_at", "2016-05-27 17:55:48.543364"], ["updated_at", "2016-05-27 17:55:48.543364"]]
---
  def create
    @movie = Movie.create(movie_params)

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 5]]
---
  def destroy
    @movie = find_movie
    @movie.destroy

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 5]]
---
  def find_movie
    @movie = Movie.find_by_id(params[:id])